## Data Preparation

In [27]:
##import library
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
## lib to ignore warning
import warnings
warnings.filterwarnings('ignore')

import sklearn
from sklearn.impute import SimpleImputer  #to deal with null values
from sklearn.linear_model import LinearRegression




##lib for one hot encoding
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [28]:
#import data
data = pd.read_csv("Data.csv")
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [29]:
## Data division
data.columns

Index(['Country', 'Age', 'Salary', 'Purchased'], dtype='object')

In [30]:
data.info

<bound method DataFrame.info of    Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes>

In [31]:
Y = data['Purchased'].values

In [32]:
X = data.iloc[: , : -1].values

In [33]:
print(X)
print(Y)

[['France' 44.0 72000.0]
 ['Spain' 27.0 48000.0]
 ['Germany' 30.0 54000.0]
 ['Spain' 38.0 61000.0]
 ['Germany' 40.0 nan]
 ['France' 35.0 58000.0]
 ['Spain' nan 52000.0]
 ['France' 48.0 79000.0]
 ['Germany' 50.0 83000.0]
 ['France' 37.0 67000.0]]
['No' 'Yes' 'No' 'No' 'Yes' 'Yes' 'No' 'Yes' 'No' 'Yes']

* Check the missing value poportion

In [34]:
#missing value by columns

print(sum(100*(data.isnull().sum()/len(data)).round(2)>=5))

2

In [35]:
#missing value by rows

print(sum(100*(data.isnull().sum(axis = 'columns')/len(data)).round(2)>=5))

2

In [36]:
#missing value imputation
imputer = SimpleImputer(missing_values= np.nan ,strategy='mean' )

In [37]:
imputer.fit(X[: , 1:]) ##----> as we can see while using mean char types df will not have the mean so we have to choose only missing numaric column

SimpleImputer()

In [38]:
X[: , 1:] = imputer.transform(X[: , 1:])

In [39]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

#### Column transform (Catagorical data to numarical data) 
there are two types of Catagorical values
1. Nominal --> Those dont have any relation or numarical values ` Male female etc`
2. Ordinal --> those have numarical value relation ie ` Btech < Mtech < PHD `




* Onehotencoding

In [40]:
ct = ColumnTransformer(transformers=[('encoder', OneHotEncoder(), [0])], remainder='passthrough')
X = np.array(ct.fit_transform(X))

-- here transformers are passed with 3 params one as encoder 2nd one hot encoder , after that pass the list [0] wich is used for column no for which encoding will be passed and remonder whichis is used for passing the param for the other column .

In [41]:
X

array([[1.0, 0.0, 0.0, 44.0, 72000.0],
       [0.0, 0.0, 1.0, 27.0, 48000.0],
       [0.0, 1.0, 0.0, 30.0, 54000.0],
       [0.0, 0.0, 1.0, 38.0, 61000.0],
       [0.0, 1.0, 0.0, 40.0, 63777.77777777778],
       [1.0, 0.0, 0.0, 35.0, 58000.0],
       [0.0, 0.0, 1.0, 38.77777777777778, 52000.0],
       [1.0, 0.0, 0.0, 48.0, 79000.0],
       [0.0, 1.0, 0.0, 50.0, 83000.0],
       [1.0, 0.0, 0.0, 37.0, 67000.0]], dtype=object)

- Getdummies

In [42]:
dummies = pd.get_dummies(data.Country)  #it will segrigate the values into 0 and 1 and will make 3columns (no of catagory)
dummies

   France  Germany  Spain
0       1        0      0
1       0        0      1
2       0        1      0
3       0        0      1
4       0        1      0
5       1        0      0
6       0        0      1
7       1        0      0
8       0        1      0
9       1        0      0

In [43]:
#after that we have to marge the columns with the dataset which is given below.
merged = pd.concat([data,dummies] , axis = 'columns')
merged.head

<bound method NDFrame.head of    Country   Age   Salary Purchased  France  Germany  Spain
0   France  44.0  72000.0        No       1        0      0
1    Spain  27.0  48000.0       Yes       0        0      1
2  Germany  30.0  54000.0        No       0        1      0
3    Spain  38.0  61000.0        No       0        0      1
4  Germany  40.0      NaN       Yes       0        1      0
5   France  35.0  58000.0       Yes       1        0      0
6    Spain   NaN  52000.0        No       0        0      1
7   France  48.0  79000.0       Yes       1        0      0
8  Germany  50.0  83000.0        No       0        1      0
9   France  37.0  67000.0       Yes       1        0      0>

-  LabelEncoding

In [44]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
le.fit(data['Country'].values)

LabelEncoder()

In [45]:
le.classes_

array(['France', 'Germany', 'Spain'], dtype=object)

In [46]:
abc = le.fit_transform(data['Country'].values)
abc

array([0, 2, 1, 2, 1, 0, 2, 0, 1, 0])

In [47]:
data.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes